[Killed] BlockStatement
Desktop/MutationTests/src/animals.js:2:9
 class Gato {
-  som() {
-    return "Miau"
-  }
+  som() {}
 
   idadeHumana(idade) {
killedBy: Gato deve miar
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Miau"
Received: undefined

[Killed] BlockStatement
Desktop/MutationTests/src/animals.js:6:22
     return "Miau"
   }
 
-  idadeHumana(idade) {
-    if (idade == 1) {
-      return 15
-    }
-    else if (idade == 2) {
-      return 25
-    }
-    else if (idade > 2) {
-      return 25 + ((idade-2)*4)
-    }
-  }
+  idadeHumana(idade) {}
 }
 
killedBy: Idade gato de um ano deve ser 15 em idade humana
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: undefined

[Killed] BlockStatement
Desktop/MutationTests/src/animals.js:7:21
   }
 
   idadeHumana(idade) {
-    if (idade == 1) {
-      return 15
-    }
+    if (idade == 1) {}
     else if (idade == 2) {
       return 25
killedBy: Idade gato de um ano deve ser 15 em idade humana
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: undefined

[Killed] EqualityOperator
Desktop/MutationTests/src/animals.js:7:9
   }
 
   idadeHumana(idade) {
-    if (idade == 1) {
+    if (idade != 1) {
       return 15
     }
killedBy: Idade gato de um ano deve ser 15 em idade humana
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 15
Received: undefined

[NoCoverage] ConditionalExpression
Desktop/MutationTests/src/animals.js:10:14
     if (idade == 1) {
       return 15
     }
-    else if (idade == 2) {
+    else if (true) {
       return 25
     }

[NoCoverage] ConditionalExpression
Desktop/MutationTests/src/animals.js:10:14
     if (idade == 1) {
       return 15
     }
-    else if (idade == 2) {
+    else if (false) {
       return 25
     }

[NoCoverage] ConditionalExpression
Desktop/MutationTests/src/animals.js:13:14
     else if (idade == 2) {
       return 25
     }
-    else if (idade > 2) {
+    else if (false) {
       return 25 + ((idade-2)*4)
     }

[NoCoverage] BlockStatement
Desktop/MutationTests/src/animals.js:13:25
     else if (idade == 2) {
       return 25
     }
-    else if (idade > 2) {
-      return 25 + ((idade-2)*4)
-    }
+    else if (idade > 2) {}
   }
 }

[NoCoverage] ArithmeticOperator
Desktop/MutationTests/src/animals.js:14:21
       return 25
     }
     else if (idade > 2) {
-      return 25 + ((idade-2)*4)
+      return 25 + ((idade + 2)*4)
     }
   }

[NoCoverage] ArithmeticOperator
Desktop/MutationTests/src/animals.js:14:14
       return 25
     }
     else if (idade > 2) {
-      return 25 + ((idade-2)*4)
+      return 25 - (idade - 2) * 4
     }
   }

[Killed] BlockStatement
Desktop/MutationTests/src/animals.js:20:9
 }
 
 class Cachorro {
-  som() {
-    return "Auau"
-  }
+  som() {}
 
   idadeHumana(idade) {
killedBy: Cachorro deve latir
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Auau"
Received: undefined

[Killed] BlockStatement
Desktop/MutationTests/src/animals.js:24:22
     return "Auau"
   }
 
-  idadeHumana(idade) {
-    return idade*7
-  }
+  idadeHumana(idade) {}
 }
 
killedBy: Idade cachorro deve ser 7 vezes maior que humana
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 35
Received: undefined

[Killed] ArithmeticOperator
Desktop/MutationTests/src/animals.js:25:12
   }
 
   idadeHumana(idade) {
-    return idade*7
+    return idade / 7
   }
 }
killedBy: Idade cachorro deve ser 7 vezes maior que humana
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 35
Received: 0.7142857142857143
